{
  "contrasena": "0f451e8c12d0ef0125ae8a0c0714ed33214d66d7e48642859ba373024a83f481",
  "chats": {
    "Chat principal": []
  },
  "archivos": [
    {
      "nombre": "3erdepartamental.pdf",
      "contenido": {
        "tipo": "texto",
        "texto": " \nBenemérita Universidad Autónoma de Puebla  \nFac. de Cs. de la Computación   \nAdministración de Proyectos \nSección: \nNRC: 26082 \nPeriodo: Otoño 2025 \nDocente:  AMBROSIO VÁZQUEZ ALMA DELIA \n 3er Departamental \nIntegrantes de equipo: \n202337420    Osvaldo Juarez Tlamani , jt202337420@alumno.buap.mx  \n202335806    Sergio Uriel García Hernández , gh202335806@alm.buap.mx  \n202326531    Jahir Flores Zaragoza ,fz202326531@alumno.buap.mx  \n202268953  Toledo Durán David Alejandro,david.toledodu@alumno.buap.mx \n202329239   ISRAEL IGNACIO CALDERÓN \nPAISANO,cp202329239@alm.buap.mx \n202319046   Maria Fernanda Aguas Rojas,  ar202319046@alumno.buap.mx  \n \n \n \n \n3ER. EXÁMEN DEPARTAMENTAL \n \n \n \nMETODOLOGÍAS DESARROLLADAS: PMBOK, COBIT, CMMI, ITIL \n \n \n \n \nDESARROLLO HUMANO: SOFT SKILLS \n \n \n \n \n \n \n \n \n \n \n \n \n ÍNDICE DEL PROYECTO: PASTILLERO INTELIGENTE \n REFLEXIÓN INDIVIDUAL \nCalderon Paisano Israel Ignacio: Muchas veces ingresamos a la carrera con la mentalidad \nde sólo aprender a programar y si compila, está todo hecho. Además podemos ver a la \nadministración de proyectos como algo de relleno que puede parecer tedioso y aburrido, sin \nembargo todo va más allá de ser un “programador solitario” ya que en proyectos a gran \nescala es necesario el tiempo, costo, alcance pero sobre todo organización. Gestionar \npersonas, recursos, tiempos y avances es fundamental para desarrollar cualquier cosa y \nprácticamente así se rige el mundo empresarial actualmente, por eso, poner atención y \nprofundizar en el contenido que existe para la administración de proyectos es fundamental \npara desarrollar habilidades que potencien a nuestros conocimientos técnicos ya que con \nellas podremos ser profesionales de alto valor ante cualquier situación o proyecto.  \n \nToledo Durán David Alejandro: Esta materia me pareció complementaria a nuestros \nconocimientos, puesto que las materias que llevo en ingeniería se basan principalmente en \nla resolución de problemas, pero muchas veces como computólogo esta resolución es en \nsolitario, ya que se nos enseña a saber salir de los problemas solos y sobre todo a \ninvestigar por nuestra cuenta. Pero esta materia cambia un poco esto, nos enseña a \ntrabajar en equipo y sobre todo cosas como gestión de riesgos, gestión de contratos, \ncompras y adquisiciones externas; de igual forma habilidad para evaluar, dirigir y \nmonitorizar. Cosas que, por lo menos en mi caso, no había visto en ninguna materia a \nexcepción de ITIL, ya que sí he tenido que aplicar cosas para restaurar rápidamente los \nservicios (incidentes) e identificar y resolver las causas raíz de los problemas. \nConsidero que esta visión integral es esencial para aplicar nuestros conocimientos técnicos \nen el trabajo. Nos ayuda a asegurar que los proyectos no solo sean técnicamente correctos, \nsino que también se completen a tiempo, sin exceder el presupuesto y cumpliendo con los \nobjetivos del negocio. \n \n \nGarcía Hernández Sergio Uriel: En lo personal siempre me pareció que la administración de \nproyectos no era algo para mi, siempre he sentido que toda la documentación y todo el \ntrabajo administrativo es algo tedioso, me cuesta redactar cierto tipo de textos, pero al final \nla materia me hizo cambiar un poco mi visión sobre la misma, me hizo entender muchas \ncosas que yo desconocía y que son realmente importantes a la hora de desarrollar un \nproyecto, tambíen me aportó en el ámbito social, ya que al ser una materia en la que es \nnecesario trabajar en equipo, nos impulsa a ser más sociables y aprender a convivir con \ncompañeros y trabajar en conjunto en un mismo proyecto, lo cual no es muy común en \nnuestra carrera o al menos no a esta escala, creo firmemente que gracias a cursar esta \nmateria voy a estar más listo o al menos no iré de 0 al mundo empresarial gracias a el \ncontenido y las actividades que trabajamos este semestre. \n \n \n \n \n \n \nJahir Flores Zaragoza  \nMi perspectiva sobre el desarrollo cambió al enfocarme en la documentación de estándares. \nLa materia demostró que la Planificación de la Calidad requiere definir el Marco de Trabajo \nde TI (lenguajes, herramientas de control de versiones) antes de escribir la primera línea de \ncódigo. La exigencia de documentar el Diagrama de Flujo del Proceso Crítico y el flujo ITIL \nme enseñó que la Gestión de Servicios obliga a crear protocolos (R1, R4) que garantizan la \nrobustez. La documentación se convierte así en la Base de Conocimiento para mitigar la \ncomplejidad técnica y asegurar la continuidad. \n \nOsvaldo Juarez Tlamani \nEl mayor aprendizaje fue la disciplina en la documentación del Alcance y Requerimientos. \nComprendí que el éxito de la Aplicación Móvil depende de la claridad de los Requerimientos \nFuncionales y No Funcionales (Interfaz simple e intuitiva). El enfoque de CMMI me enseñó \nque la documentación de las Pruebas de Usabilidad y la Gestión de la Medición son pasos \nrigurosos para alcanzar la calidad y la madurez procesal. Esto es crucial para asegurar que \nla App cumpla con el propósito social del Pastillero y supere la barrera de la Baja Adopción \n(R6) \n. \nMaria Fernanda Aguas Rojas \nLa materia demostró que la Gestión de la Información es poder. Mi rol se centró en la \ncreación de los documentos fundacionales: Misión, Visión, KPI's y la Justificación. Aprendí \nque la Matriz RACI y la Gestión de Interesados no son solo tablas, sino herramientas para \nformalizar la autoridad y el compromiso, que son vitales para la ejecución. La Gestión de \nRiesgos se convirtió en mi herramienta principal, obligándome a documentar cómo el valor \nde negocio (Mitigar R6) justifica la inversión metodológica y el Gasto Directo en RR.HH. \n \nLINK DE VIDEO “DESARROLLO SOFT SKILLS” \n \nSoft skills \nhttps://youtu.be/-K-n-9Vb0fI?si=Son6YbZw3Ax1Tcgz \n \nI. GESTIÓN DE INTEGRACIÓN DEL PROYECTO \n1.​ Problemática a resolver \nProtocolo del Proyecto 1.1. Conformación de la idea (Requerimientos funcionales, no \nfuncionales y de dominio, hardware, software, tecnologías emergentes)​\n 1.2. Misión​\n 1.3. Visión​\n 1.4. Metas​\n 1.5. Objetivos y KPI’s​\n 1.6. Justificación​\n 1.7. Estrategias​\n 1.8. Estudio de viabilidad​\n 1.9. Estudio de factibilidad \nII. GESTIÓN DE TIEMPO DEL PROYECTO \n2.​ Secuencia de Actividades y Estimación de la Duración (Plan de 18 Semanas) \n3.​ Desarrollo del Cronograma en Gráfica de Gantt \n4.​ Estimación de recursos de las actividades \n5.​ Hitos y Tiempos \n6.​ Diagramas de Flujo (Se adjuntará un diagrama de alto nivel) \nIII. GESTIÓN DE RECURSOS HUMANOS \n7.​ Planes de Gestión de Personal (Roles y Responsabilidades) \n8.​ Planes de Carrera de Personal \nIV. GESTIÓN DE CALIDAD DEL PROYECTO \n9.​ Objetivos de Calidad \n10.​KPI’s de Calidad \n11.​Hitos de Calidad \n12.​Planificación de la Calidad (Estrategias y Pruebas) \nV. GESTIÓN DE COSTES DEL PROYECTO \n13.​Estimación de Costes del Proyecto (Gastos directos e indirectos)​\n 13.1. Coste Detallado del Hardware (Prototipo único) \nVI. GESTIÓN DE ADQUISICIONES DEL PROYECTO \n14.​Planificar Compras y Adquisiciones 14.1. Estrategia de Adquisición de Hardware \n(Compra Directa)​\n 14.2. Estrategia de Subcontratación (Servicio de Ensamblaje)​\n 14.3. Proceso de Adquisición \n \nVII. GESTIÓN DE COMUNICACIONES DEL PROYECTO \n15.​Comunicación Externa e Interna \nVIII. GESTIÓN DE RIESGOS DEL PROYECTO \n16.​Metodología de Gestión de Riesgos \n17.​Identificación de Riesgos y Respuesta a los Riesgos 17.1. Técnicas de Identificación \nUtilizadas​\n 17.2. Categorías de Riesgos Identificados (Técnicos, Financieros, Operativos, etc.)​\n 17.3. Registro de Riesgos (Risk Register)​\n 17.4. Matriz Probabilidad-Impacto​\n 17.5. Estrategia de Monitoreo \n \n \n \n \n \n \n \n \n \nGESTIÓN DE INTEGRACIÓN DEL PROYECTO \nProject Protocol \nProblem Statement   \nHigh health risks and low therapeutic adherence associated with polypharmacy in older \nadults. \nConcept \nFormation \n(Functional, \nNon-functional, \nand \nDomain \nRequirements, \nHardware, Software, Emerging Technologies) \n1. Concept Formation  \nGiven the growing challenge of polypharmacy, which primarily affects older adults and \nchronic patients, there is a need to improve adherence to pharmacological treatments and \nreduce errors in medication intake. This project consists of developing a smart pill \ndispenser system integrated with a mobile application. The dispenser will feature \nmultiple compartments that release automatically at pre-established times, while the \napplication will allow for remote medication management and treatment supervision. \nThe main objective is to guarantee that the patient takes the correct medication, in the \ncorrect dose, and at the correct time, improving their quality of life and providing peace of \nmind to their family members. \nTo guarantee the system's efficacy, emerging technologies such as the Internet of Things \n(IoT) and cloud computing will be incorporated. \n \na) Functional Requirements \n●​ User Profile Management: The application must allow creating and configuring user \nprofiles, including personal data and treatment details. \n●​ Medication Schedule Reminders: Via audible and light alarms. \n●​ Automatic Unlocking: The pill dispenser must automatically unlock the \ncorresponding compartment at the scheduled intake time. \n●​ Medication Management: The application must allow the user to add, edit, and \ndelete medications, specifying names and doses. \n●​ Notifications to Family/Caregivers: Sending notifications in case of a missed dose. \n●​ Alert Programming: The user must be able to define specific schedules for each \nmedication or group of medications. \n●​ Synchronization: Data between the application and the dispenser must be \nsynchronized at all times, even if the application is not open. \n●​ Simple and Intuitive Interface. \n \n \n \nb) Non-functional Requirements \n●​ High Availability: Minimal failures in alerts. \n●​ Low Power Consumption: Use of a long-lasting rechargeable battery. \n●​ Secure Connectivity: Protection of medical data. \n \n \nc) Domain Requirements \n●​ Knowledge of polypharmacy routines in older adults. \n●​ Compliance with basic medical device regulations. \n●​ Integration with the needs of caregivers and health personnel. \n \n \nd) Necessary Hardware \n●​ Pill dispenser with electronic compartments. \n●​ Sound/Vibration module. \n●​ Bluetooth/WiFi connection. \n●​ Sensors to detect the opening/closing of compartments. \n \ne) Necessary Software \n●​ Multiplatform mobile application (Android/iOS). \n●​ Cloud server for data storage and notifications. \n●​ Schedule management and reminder algorithm. \n \n \nf) Emerging Technologies \n●​ Artificial Intelligence (prediction of forgetfulness or routine adjustments). \n●​ Mobile Computing. \n●​ Big Data. \n●​  \n \n \n \n \nMission (What is your project for at this moment?) To reduce the risks associated with \npolypharmacy in older adults through a technological solution that guarantees safety in drug \nconsumption and serves as support for caregivers and family members.​\n \nVision (How does the project look in the future?) To be an innovative and accessible tool \nthat promotes safer treatments, reducing hospitalizations due to adverse effects and \nincreasing the autonomy and quality of life of older adults.​\n \nGoals \n●​ Decrease forgetfulness, dosage errors, and dangerous interactions between \nmedications. \n●​ Reduce hospitalizations related to adverse effects. \n●​ Serve as practical support for caregivers and family members. \n​\n \nObjectives and KPIs \n●​ General Objective: To guarantee that older adults with chronic diseases take their \nmedications safely, in the correct dose and schedule, through an integrated system \nof a smart pill dispenser and a mobile application. \n●​ KPIs: \n○​ Percentage of correctly administered doses (Target: >90%). \n○​ Reduction rate of hospitalizations due to medication mismanagement (Target: \n-20%). \n○​ Level of user and caregiver satisfaction (via surveys). \n○​ Improvement in user health (with patient studies). \n \nJustification \nPolypharmacy in older adults represents a growing public health problem. According to CDC \ndata, 83% of adults between 60 and 70 years old consumed at least one prescription \nmedication in the last 30 days, and approximately one-third used five or more drugs \nsimultaneously [3]. This practice increases the risk of adverse effects, dangerous \ninteractions, falls, and cognitive impairment [1][2], in addition to generating a significant \neconomic and emotional burden for both patients and caregivers. Likewise, it is estimated \nthat three out of four older adults present two or more chronic conditions (MCC) [4], which \nelevates the complexity of therapeutic management. In people with dementia, the situation is \neven more serious: 13.9% end up consuming three or more psychotropic or opioid \nmedications for more than a month, increasing the risk of dependence, overdose, and \nmortality [3]. Faced with this scenario, the development of a smart pill dispenser \nsupplemented with a mobile application constitutes an innovative and viable alternative that \nseeks to improve therapeutic adherence—that is, how well a patient follows the medical \ntreatment indicated by their doctor—reduce the risks of polypharmacy, and strengthen the \nquality of life of older adults. \n \n \nStrategies – How will things be done? \n●​ User-Centered Design with pilot tests on older adults. \n●​ Implementation of a simple app for family members and caregivers. \n●​ Marketing focused on nursing homes and clinics. \n​\nViability Study – Is it really possible to realize the project? The development of the \nprototype is technically viable because it does not require the creation of new technology, \nbut rather the integration of mature, available, and low-cost hardware and software \ncomponents. \nThe central operation of the prototype will be based on the following components: \n1.​ Central Processing Unit (MCU): An ESP32 microcontroller will be selected. This choice is \nfundamental because the ESP32 already integrates WiFi and Bluetooth connectivity on a \nsingle chip. This eliminates the complexity of adding external modules and is crucial for \nreal-time synchronization with the mobile app and the cloud server. \n○​\nWatch product (ESP32): \nhttps://www.geekfactory.mx/categoria-de-producto/tarjetas/esp32\n-esp8266/ \n2.​ Dispensing Mechanism: The pill dispenser will feature multiple compartments. Each \ncompartment will be secured by an individual lid or latch, which will be actuated by a \nmicro-servomotor (e.g., SG90). When the scheduled time arrives, the ESP32 firmware will \nsend a signal to the specific servo to rotate and release only the corresponding compartment.. \n○​\nWatch product (Micro-servomotor SG90): \nhttps://sandorobotics.com.mx/producto/sg90/ \n3.​ Alert and Notification System: To meet the alarm requirement, high-brightness LEDs (visual \nalert) and a buzzer (audible alert) will be integrated. These will activate simultaneously with \nthe release of the compartment. \n○​\nWatch product (LEDs): \nhttps://www.steren.com.mx/led-ultrabrillante-de-5-mm-color-blan\nco.html \n○​\nWatch product (Zumbador): \nhttps://aragonelectronica.com/products/buzzer-zumbador-activo-5\nv \n4.​ Feedback Sensors: To verify intake and enable forgotten dose notifications, each \ncompartment will integrate sensors to detect its opening, such as limit switches. If the sensor \ndoes not detect opening after a prudent time, the ESP32 will send an alert to the cloud server, \nwhich in turn will trigger the push notification to the caregiver. \n○​\nWatch product (Interruptor de límite / Microswitch): \nhttps://natytec.com.mx/shop/electronica-cnc/micro-interruptor-s\nwitch-de-limite-completo/ \n5.​ Power Supply: To meet the requirement of low consumption and long duration, the system \nwill be powered by a rechargeable Lithium-Polymer (LiPo) battery. The viability of this choice \nis sustained by the use of the ESP32's \"deep-sleep\" modes, allowing the device to consume \nminimal energy while waiting for the next alarm. \n○​\nWatch product (Batería LiPo): \nhttps://sandorobotics.com.mx/producto/slw-506971/ \n6.​ Prototype Casing: The physical structure housing these components will be manufactured \nvia 3D printing, using materials such as PETG or PLA. This allows for rapid, iterative, and \nvery low-cost prototyping.. \n○​\nWatch product (Filamento PETG): \nhttps://www.geekfactory.mx/producto/rollo-filamento-petg-175mm-\n1kg/ \nRegulatory viability is high. The device is classified as a basic medical support product. Its main \nfunction is reminder and management, not automated medical dispensing (it does not formulate or \nprepare doses, it only releases them). This exempts it from the most complex and costly certifications \nrequired for invasive or critical diagnostic medical devices, facilitating its eventual registration and \ncommercialization. \nFeasibility Study – Is it possible to implement the project? \nThe project is feasible because the skills required for its development directly coincide with the roles \nassigned to the team. Advanced research is not required, but rather the application of existing \nknowledge: \n●​\nHardware and Firmware Feasibility: The Hardware/Electronics Leader (David Toledo) is \nassigned to the physical prototype design, component selection, and electronics assembly. \nThe Software Development Leader (Firmware and Backend) (Jahir Flores) is assigned to the \nESP32 firmware programming and cloud server configuration. The connection between both \nwill be made using common standards (WiFi and Bluetooth). \n●​\nSoftware Feasibility (Mobile Application): The development of the multiplatform application \n(Android/iOS) is feasible. The Mobile Application Development Leader (Osvaldo Juarez) is \nassigned to this task, and the risk mitigation plan (R4) specifies the use of frameworks like \nFlutter or React Native. This strategy allows using a single code base for both platforms, \nmaking development feasible within the stipulated time.. \n●​\nManagement and Quality Feasibility: The team has a Project Manager (Sergio García) for \nsupervision and Business and Quality Analysts (Maria Fernanda and Israel) to ensure \nrequirements are met and quality tests are performed. \nThe feasibility of the project is significantly reinforced by the strategic decision to subcontract the \nassembly service and the manufacturing of the final casing for the pilot batch. \nThe team (students) will handle the design, validation, and prototyping (using 3D printing). However, \nby outsourcing the assembly, the team avoids a bottleneck for which they do not possess industrial \ncapacity. This allows team members to focus on their strengths (software, firmware, and \nmanagement), making the production of the pilot batch operationally feasible. \nIn addition to the team's technical capacity, the project is feasible in the real world due to three key \nexternal factors: market need, adoption strategy, and low regulatory barriers. \n1.​ Market Feasibility (Urgent Need): The project is not based on an invented need; it responds \nto a critical and growing public health problem: polypharmacy in older adults. With statistics \nindicating that one-third of older adults consume five or more drugs simultaneously and three \nout of four suffer from chronic diseases, there is a clear and demonstrable demand for a \nsolution that reduces the risks of forgetfulness, falls, and adverse effects. The target market \n(patients, caregivers, clinics, and nursing homes) is broad and actively seeking solutions. \n \n2.​ Adoption Feasibility (User-Centered): The main barrier in the real world for Health Tech \nproducts aimed at older adults is low technological adoption. This project is feasible because \nits design attacks this problem directly. The strategy of \"User-Centered Design with pilot tests \non older adults\" and the requirement for a \"Simple and Intuitive Interface\" are not optional, but \nthe core of the value proposition. The mitigation planning for risk R6 (Low adoption) includes \na \"starter kit with visual guides and assisted setup,\" demonstrating that ease of use is a pillar \nof the project. \n \n \n3.​ Regulatory and Commercial Feasibility: The project is commercially feasible because the \nbase technology (ESP32, sensors) is very low cost, allowing the final product to have an \naccessible and competitive price. Even more important is the regulatory viability: the device is \nclassified as a \"basic medical support product.\" Its function is reminder, not automated \nmedical dispensing. This is crucial, as it \"facilitates its future registration and \ncommercialization\" by not requiring the complex and extremely expensive certifications of \nhigh-risk medical devices. \nThe 18-week schedule is feasible precisely because the project is based on the integration \nof existing technologies (Viability) and a clear division of roles (Resource Feasibility). The \n8-week \"Development and Testing\" phase is correctly sized for the programming and \ncomponent integration tasks described. \n \n \nGestión de Tiempo del Proyecto \nSecuencia de Actividades y Estimación de la Duración \nEl proyecto está planificado para una duración total de 18 semanas. Las actividades están \norganizadas por fases: \n1.​ Fase de Inicio (3 semanas) \n○​ Actividad: Indagación de problemas y Conformación de la idea (2 semanas) \n■​ Descripción: Se investiga el problema de la polimedicación en \nadultos mayores. Se define la idea central del proyecto: un pastillero \ninteligente con una aplicación móvil. \n○​ Actividad: Definición de objetivos, KPI's, misión, visión y metas (1 semana) \n■​ Descripción: Se establecen los pilares del proyecto, incluyendo los \nobjetivos de calidad y los indicadores clave de rendimiento (KPIs) \npara medir su éxito. \n○​ Actividad: Estudios de viabilidad y factibilidad (1 semana) \n■​ Descripción: Se analiza si el proyecto es posible de realizar e \nimplementar desde un punto de vista técnico, económico y social. \n○​ Actividad: Elaboración y aprobación del acta constitutiva (1 semana) \n■​ Descripción: Se formaliza el inicio del proyecto con la aprobación del \nacta constitutiva. \n2.​ Fase de Planificación (5 semanas) \n○​ Actividad: Búsqueda y subcontrato de empresa de ensamblaje (3 semanas) \n■​ Descripción: Se identifican y seleccionan posibles proveedores para \nel ensamblaje del hardware del pastillero. \n○​ Actividad: Estimación de costos (4 semanas) \n■​ Descripción: Se calculan los gastos directos e indirectos del \nproyecto. \n○​ Actividad: Planificación de la calidad (3 semanas) \n■​ Descripción: Se definen los estándares de calidad que debe cumplir \nel producto y se crea un plan para asegurar que se cumplan. \n○​ Actividad: Planificación de la comunicación (2 semanas) \n■​ Descripción: Se definen los canales y el flujo de comunicación \ninterna y externa para el equipo de trabajo y las partes interesadas. \n○​ Actividad: Gestión de riesgos (2 semanas) \n■​ Descripción: Se identifican los posibles riesgos del proyecto \n(técnicos, económicos, etc.) y se planifican las respuestas para \nmitigarlos. \n○​ Actividad: Gestión de publicidad y marketing (2 semanas) \n■​ Descripción: Se planean estrategias de marketing enfocadas en \nhogares de ancianos y clínicas. \n3.​ Fase de Desarrollo y Pruebas (8 semanas) \n○​ Actividad: Diseño del prototipo de hardware (3 semanas) \n○​ Actividad: Diseño de la arquitectura de la aplicación móvil (4 semanas) \n○​ Actividad: Ensamblaje y pruebas del prototipo físico (4 semanas) \n○​ Actividad: Programación del firmware del pastillero (6 semanas) \n○​ Actividad: Desarrollo de la aplicación móvil (8 semanas) \n○​ Actividad: Pruebas de integración del sistema (3 semanas) \n○​ Actividad: Pruebas piloto con usuarios (1 semana) \n4.​ Fase de Cierre (2 semanas) \n○​ Actividad: Conclusiones finales y presentación del proyecto (2 semanas) \nHitos del Proyecto \n●​ Hito 1 (Semana 3): Fin de la fase de inicio. Se ha formalizado el proyecto con el \nacta constitutiva y los estudios de viabilidad y factibilidad. \n●​ Hito 2 (Semana 8): Fin de la fase de planificación. Se han estimado los costos, se \nhan definido los planes de comunicación, calidad y riesgos, y se ha subcontratado \nuna empresa para el ensamblaje. \n●​ Hito 3 (Semana 16): Prototipo funcional del pastillero y la aplicación móvil listos para \nlas pruebas finales. \n●​ Hito 4 (Semana 18): Presentación del proyecto final. \n \n \n \n \nGestión de Recursos Humanos del Proyecto \nPlanes de Gestión de Personal \nEl equipo de proyecto está compuesto por estudiantes de la Facultad de Ciencias de la \nComputación de la BUAP, con perfiles complementarios para cubrir todas las áreas de \ndesarrollo. Cada miembro tendrá un rol y responsabilidades claramente definidas para \nasegurar un flujo de trabajo eficiente. \n●​ Gerente de Proyecto: Sergio Uriel García Hernández \n○​ Responsabilidades: \nSupervisión \ngeneral \ndel \nproyecto, \ngestión \nde \ncronogramas y recursos, coordinación del equipo y comunicación con las \npartes interesadas. \n○​ Habilidades clave: Liderazgo, organización y resolución de problemas. \n●​ Líder de Hardware/Electrónica: Toledo Durán David Alejandro \n○​ Responsabilidades: Diseño del prototipo físico, selección de componentes \nelectrónicos, ensamblaje del pastillero y supervisión de las pruebas de \nhardware. \n○​ Habilidades clave: Conocimiento en electrónica, prototipado y manejo de \nsensores. \n●​ Líder de Desarrollo de Software (Firmware y Backend): Jahir Flores Zaragoza \n○​ Responsabilidades: Programación del firmware del pastillero, desarrollo de \nla lógica de sincronización y configuración del servidor en la nube. \n○​ Habilidades clave: Programación embebida (firmware), gestión de bases de \ndatos y servicios en la nube. \n●​ Líder de Desarrollo de Aplicaciones Móviles: Osvaldo Juarez Tlamani \n○​ Responsabilidades: Desarrollo de la aplicación móvil multiplataforma \n(Android/iOS), implementación de la interfaz de usuario (UI) y gestión de \nnotificaciones. \n○​ Habilidades clave: Desarrollo de aplicaciones móviles (Flutter/React Native) \ny diseño de UI/UX. \n●​ Analistas de Negocio y Calidad: Maria Fernanda Aguas Rojas e Israel Ignacio \nCalderón  Paisano \n○​ Responsabilidades: Recopilación de requerimientos, definición de KPIs, \nrealización de pruebas de calidad y análisis de la viabilidad social y de  \nPlanes de carrera de personal.​\n \nEl Plan de Carrera para el equipo se centra en la adquisición y especialización de \nhabilidades clave en el sector de tecnología y salud, preparando a los integrantes para roles \navanzados dentro de una futura organización o en el mercado laboral. \n \n \n \n \nBeneficios Clave del Plan de Carrera \n1.​ Portafolio de Alto Nivel: Cada miembro obtendrá un producto físico (el pastillero) y \nun producto de software (la aplicación) totalmente documentado, que servirá como \nprueba tangible de sus capacidades ante futuros empleadores. \n2.​ Exposición a Tecnologías Emergentes: El equipo adquiere experiencia práctica en \nel Internet de las Cosas (IoT) y la computación en la nube , con una visión a futuro \nen la implementación de Inteligencia Artificial (IA). \n3.​ Habilidades Blandas: El plan promueve la comunicación efectiva y el​\n diseño centrado en el usuario, cruciales para el éxito en el desarrollo de \ndispositivos médicos. \n \nGerente de Proyecto \n(Sergio Uriel G. H.) \nCertificación en \ngestión de proyectos \n(e.g., Scrum Master). \nGerente de Programa \no Director de \nOperaciones \n(enfocado en \nescalamiento). \nLiderazgo de equipos \ntécnicos y gestión de \nriesgos estratégicos. \nLíder de \nHardware/Electrónica \n(Toledo Durán D. A.) \nInvestigación y \ndesarrollo de la \nversión 2.0 del \npastillero con IA. \nIngeniero Senior de \nI+D o Especialista en \nIoT/Electrónica \nMédica. \nOptimización de bajo \nconsumo de energía y \nminiaturización de \ncomponentes. \nLíder de Desarrollo de \nSoftware (Firmware y \nBackend) (Jahir \nFlores Z.) \nProfundización en \nseguridad de datos \nmédicos y \narquitectura en la \nnube (AWS/Azure). \nArquitecto de \nSoluciones Cloud o \nIngeniero de Firmware \nAvanzado. \nAlta disponibilidad , \nseguridad y desarrollo \nde algoritmos de \ngestión de horarios. \nLíder de Desarrollo de \nAplicaciones Móviles \n(Osvaldo J. T.) \nEspecialización en \nUX/UI para adultos \nmayores y desarrollo \nmultiplataforma \navanzado \n(iOS/Android). \nEspecialista en \nExperiencia de \nUsuario (UX) o Líder \nTécnico Móvil. \nAnalistas de Negocio \ny Calidad (Maria \nFernanda A. R. y \nISRAEL I. C. P.) \nAdquisición de \nconocimiento de \nnormativas de \ndispositivos médicos y \nestudio de viabilidad \neconómica avanzada. \nConsultor de \nHealthTech o \nEspecialista en \nCumplimiento y \nCalidad. \nAseguramiento de la \nCalidad (QA), análisis \nde KPIs y estrategias \nde mercado. \nGESTIÓN DE CALIDAD DEL PROYECTO \nOBJETIVOS \nGarantizar que el pastillero funcione con un 90% de confiabilidad en las alertas sonoras y \nvisuales. \nAsegurar que la aplicación móvil tenga una probabilidad de error menor al 1% en la gestión \nde los medicamentos. \nKPI’S DE CALIDAD \n●​ Probabilidad de fallos del hardware: < 2% en pruebas de estrés \n●​ Tiempo de respuesta de la app: < 3 segundos en 90% de las operaciones \n●​ Satisfacción del usuario: > 85% en pruebas piloto con adultos mayores \n●​ Cobertura de pruebas: > 90% del código fuente \n●​ Probabilidad de sincronización exitosa: > 98% entre app y pastillero \nHITOS DE CALIDAD \n●​ Semana 6: Revisión de especificaciones técnicas y estándares de desarrollo \n●​ Semana 10: Pruebas de usabilidad con 5 adultos mayores (prototipo inicial) \n●​ Semana 14: Pruebas de estrés del sistema integrado (hardware + software) \n●​ Semana 16: Validación final de cumplimiento de todos los requerimientos \nPLANIFICACIÓN DE LA CALIDAD \n●​ Revisiones técnicas semanales: Análisis del código y documentación. \n●​ Pruebas automatizadas: Ejecución diaria de pruebas unitarias y de integración. \n●​ Pruebas de usabilidad mensuales: Sesiones con usuarios reales (adultos mayores \no cuidadores). \n●​ Control de versiones: Uso de Git para gestionar cambios en el código. \n●​ Documentación de procesos: Registro de todos los hallazgos y mejoras. \n●​ Capacitación del equipo: Sesiones sobre estándares de calidad y mejores \nprácticas. \n \n \nGestión de costes del proyecto \nEl estimado de costes se divide en dos categorías principales: Gastos Directos, que son \ndirectamente atribuibles al producto (hardware, software, subcontratación), y Gastos \nIndirectos, que son necesarios para la gestión y operación del proyecto (recursos humanos, \noverhead). \n1. Estimación de Gastos Directos (Capital y Desarrollo) \nEstos costos están directamente relacionados con la producción del prototipo funcional y la \ninfraestructura del sistema. Se considera un coste inicial bajo, lo cual es competitivo en el \nmercado de dispositivos médicos básicos. \n \nConcepto \nDetalle \nCoste Estimado \n(MXN) \nJustificación \nHardware para Prototipo Componentes \npara \nel \npastillero \n(Microcontrolador, \nServos, Carcasa 3D) \n3,500 \nComponentes de fácil \nacceso y bajo costo. \nInfraestructura \nde \nSoftware \nLicencia de servidor en la \nnube (primer año) \n5,000 \nNecesario \npara \nla \nsincronización y la alta \ndisponibilidad. \nPlataformas \nde \nDesarrollo \nLicencias para herramientas \nde diseño UI/UX y desarrollo \nmultiplataforma \n3,500 \nHerramientas \nnecesarias \npara \nla \ninterfaz \nsimple \ne \nintuitiva. \nPruebas y Certificación \nBásica \nMateriales para pruebas de \nintegración y simulación de \nnormativas \n2,500 \nGastos esenciales para \nverificar la calidad. \nSubcontratación \n(Ensamblaje) \nCoste \nestimado \nde \nnegociación para el lote piloto \n(externo) \n6,000 \nCoste relacionado con \nla \nactividad \nde \nplanificación \nde \nsubcontrato. \nRecursos \nHumanos \n(Costo Teórico/Beca) \nValoración del tiempo de los \n6 integrantes del equipo (18 \nsemanas \na \n3,000 \nMXN/semana) \n54,000 \nCoste directo de la \nmano \nde \nobra \nproductiva \ndel \nproyecto. \nSubtotal \nGastos \nDirectos \n \n74,500 \n \nBuffer de Contingencia \n(15%) \n \n11,175 \nProtección \nfinanciera \nante \nvolatilidad \ndel \nmercado. \nTOTAL \nGASTOS \nDIRECTOS \n \n85,675 \n \n \n2. Estimación de Gastos Indirectos (Operación y Gestión) \nEstos costes se centran en el valor del recurso humano y los gastos operativos del \nproyecto. \n \n \n \nConcepto \nDetalle \nDuración \n(Semanas) \nCoste por \nSemana (MXN) \nCoste Total \n(MXN) \nComunicaciones \ny \nMarketing \nElaboración \nde \nmaterial \npublicitario \ndigital \ny \nmarketing inicial \n18 \n500 \n9,000 \nViáticos y Logística \nReuniones \nde \nequipo, \ntransporte y materiales para \npruebas piloto \n18 \n400 \n7,200 \nGastos de Oficina y \nSuministros \nMaterial \nde \npapelería, \nimpresiones \n(documentación), \nservicios \nbásicos \n(luz/internet \ncompartidos). \n18 \n200 \n3,600 \nGestión y Overhead \nCostos \nde \ngestión \nde \nproyecto y amortización de \nequipos \npropios \n(computadoras). \n18 \n400 \n7,200 \nSubtotal \nGastos \nIndirectos \n \n \n \n27,000 \nBuffer de Contingencia \n(15%) \n \n \n \n4,050 \nTOTAL \nGASTOS \nINDIRECTOS \n \n \n \n31,050 \n \n3. Resumen de Costes del Proyecto \nEl coste total estimado para la fase de documentación y desarrollo del prototipo funcional \ndel Pastillero Inteligente es el siguiente: \n \n \nCategoría \nSubtotal (MXN) \nBuffer 15% (MXN) \nTotal con Buffer (MXN) \nGastos Directos \n74,500 \n11,175 \n85,675 \nGastos Indirectos \n27,000 \n4,050 \n31,050 \nCOSTE TOTAL DEL \nPROYECTO \n101,500 \n15,225 \n116,725 \n \nEsta estimación asegura que el desarrollo del prototipo inicial se puede realizar con una \ninversión controlada, confirmando la viabilidad económica del proyecto. \n \nGestión de Adquisiciones del Proyecto \nEl objetivo de esta gestión es asegurar que los bienes y servicios externos necesarios para \nel proyecto (principalmente el hardware y el servicio de ensamblaje) se adquieran de \nmanera oportuna, rentable y con la calidad requerida. \nPlanificar Compras y Adquisiciones \nLa estrategia de adquisiciones se centrará en dos tipos principales de contratos: la compra \ndirecta de componentes electrónicos y la subcontratación de servicios de fabricación \ny ensamblaje. \n1. Estrategia de Adquisición de Hardware (Compra Directa) \n●​ Alcance: Adquisición de todos los componentes electrónicos de bajo coste para el \nprototipo (microcontroladores, sensores, servomotores SG90, baterías, etc.). \n●​ Tipo de Contrato: Orden de Compra Fija (Fixed-Price Purchase Order). Se \nutilizarán plataformas en línea especializadas (como las usadas en la justificación de \ncostes) para asegurar precios unitarios bajos y transparentes. \n●​ Justificación: El bajo coste y la alta disponibilidad de los componentes permiten \nuna compra directa rápida y eficiente, lo que minimiza el riesgo de sobrecostos en la \nfase de prototipado. \n2. Estrategia de Subcontratación \n●​ Alcance: Contratación de una empresa o taller especializado para la fabricación del \nlote piloto de la carcasa final y el ensamblaje de la electrónica, después de validar el \nprototipo. \n●​ Tipo de Contrato: Contrato de Precio Fijo (Fixed-Price Contract). El \nsubcontratista cotizará un precio fijo para la producción de un lote de prueba (ej. 50 \nunidades), asumiendo el riesgo de los costes. \n●​ Justificación: La subcontratación es esencial porque el equipo de proyecto no tiene \nla capacidad industrial para la producción en masa de carcasas de alta calidad ni el \ntiempo para el ensamblaje de grandes lotes. Esto garantiza un acabado profesional \npara el producto final. \nProceso de Adquisición \n1.​ Requerimiento de Compras: El Líder de Hardware/Electrónica genera la lista de \nmateriales (BOM) y especificaciones técnicas. \n2.​ Solicitud de Información (RFI): Para la subcontratación de ensamblaje, se \nenviarán solicitudes a tres proveedores potenciales para evaluar su capacidad \ntécnica y experiencia. \n3.​ Selección de Proveedor: El Gerente de Proyecto y el Líder de Hardware \nevaluarán las cotizaciones y seleccionarán a los proveedores con la mejor relación \ncalidad-precio y tiempo de entrega. \n4.​ Administración de Contratos: El Gerente de Proyecto monitoreará activamente el \ndesempeño de los proveedores subcontratados para asegurar el cumplimiento de \nlos términos y plazos establecidos en el plan de tiempo. \n \n \nGESTIÓN DE COMUNICACIONES DEL PROYECTO \nEl Plan de Gestión de Comunicaciones asegura que la información relevante sea generada, \ndistribuida, almacenada y dispuesta de forma adecuada y oportuna a lo largo de las 18 \nsemanas del proyecto. \n \n1. Comunicación Interna (Equipo de Proyecto) \nLa comunicación interna se enfoca en la coordinación efectiva, la resolución de problemas y \nla gestión del cronograma. \n \n¿Qué? \n¿Quién? \n¿A Quién? \n¿Cuándo? \nCanal/Método \nReunión de \nEstatus \nSemanal \nGerente de \nProyecto \nTodo el Equipo \nLunes por la \nmañana (1 \nhora) \nVideoconferencia y \nActa de Reunión \nReporte de \nAvance \nSemanal \nLíderes de Área \nGerente de \nProyecto \nViernes al \nfinal del día \nCorreo Electrónico y \nDocumento \nCompartido \nAlertas de \nRiesgos/Depen\ndencias \nLíderes de Área \nGerente de \nProyecto y Área \nAfectada \nInmediatame\nnte \nMensajería \nInstantánea \n(WhatsApp/Slack) \nRevisiones de \nCódigo/Diseño \nDesarrolladores/\nLíder de \nHardware \nEquipo de \nDesarrollo \nBajo \nDemanda \nHerramientas de \nControl de Versiones \n(Git) y Documentos \nCompartidos \nEstrategia Clave: Se priorizará la comunicación formal para las decisiones de diseño y \nlas alertas de riesgos, y la comunicación informal (mensajería instantánea) para la \ncoordinación diaria y la resolución rápida de problemas técnicos. \n \n2. Comunicación Externa (Partes Interesadas y Cuidadores) \nLa comunicación externa está dirigida a los usuarios finales (adultos mayores, cuidadores) y \na las partes interesadas que evalúan la viabilidad del proyecto (docentes, posibles \ninversionistas o socios comerciales). \n \n¿Qué? \n¿Quién? \n¿A Quién? \n¿Cuándo? \nCanal/Método \nManual de \nUsuario y \nCuidado \nAnalistas \nde Negocio \nUsuarios Finales \n(Simulados) y \nCuidadores \nFase de Pruebas \nPiloto (Semana \n18) \nDocumento Digital y \nContenido In-App \nNotificación \nde \nOlvido/Dosis \nSistema \n(Pastillero/\nApp) \nFamiliares/Cuidadore\ns \nEn Tiempo Real \nNotificación Push en \nla Aplicación Móvil \nPresentación \nde Avance \nGerente de \nProyecto \nDocente/Stakeholders \nPrincipales \nAl finalizar cada \nFase \nPresentación Formal \n(Diapositivas y \nDemo) \nMaterial de \nMarketing \nInicial \nAnalistas \nde Negocio \nHogares de Ancianos \ny Clínicas \n(Simulados) \nFase de \nPlanificación \n(Semanas 7-8) \nCorreo Electrónico y \nMaterial Impreso \nCotizaciones \ny Pedidos \nLíder de \nHardware \nProveedores de \nComponentes \nSegún el \ncronograma de \nadquisiciones \nCorreo Electrónico o \nllamada de \nseguimiento \n \n3.Protocolo de comunicación de crisis  \n \nNivel \nProblema \n(Ejemplos) \n¿Quién \nalerta? \n¿A quién? \nTiempo \nMedio \n1  \nFallo total del \nPrototipo \nQuien detecte \nel problema \nGerente/ \nLíderes \ntécnicos \nMáximo 1 \nhora después \nde la \ndetección  \nCorreo \nElectrónico/Vi\nsita \npresencial \n2 \nRetraso de 1 \nsemana \nLíder del área \nafectada \nGerente/ \nÁreas \ninvolucradas \nNo mayor a 1 \ndía \nCorreo \nElectrónico/Vi\nsita \npresencial \n3 \nFallo en alguna \nfuncionalidad \nResponsable \nde dicha tarea \nLíder de área \nDurante la \nreunión \nprogramada \nmás próxima \nCorreo \nElectrónico/Vi\nsita \npresencial \n \n \nGESTIÓN DE RIESGOS DEL PROYECTO \nLa gestión de riesgos en proyectos consiste en identificar, analizar y dar respuesta a \neventos inciertos que pueden impactar los objetivos del proyecto en alcance, tiempo, costo \ny calidad. Según las prácticas del PMBOK, este proceso busca minimizar amenazas y \nmaximizar oportunidades, reduciendo la incertidumbre y aumentando la probabilidad de \néxito del proyecto. \n1. Metodología de Gestión de Riesgos \nEn nuestro proyecto se seguirá el enfoque recomendado por el PMBOK:​\n 1. Planificar la gestión de riesgos → establecer cómo se gestionan.​\n 2. Identificar los riesgos → recopilar riesgos potenciales en todas las categorías.​\n 3. Análisis cualitativo de riesgos → evaluar probabilidad e impacto.​\n 4. Análisis cuantitativo de riesgos (cuando sea necesario).​\n 5. Planificar la respuesta a los riesgos → definir acciones y responsables.​\n 6. Monitorear y controlar los riesgos → actualizar el registro y hacer seguimiento periódico. \n2. Identificación de Riesgos \n2.1 Técnicas de Identificación Utilizadas \nPara garantizar una identificación exhaustiva de riesgos, se aplicaron las siguientes técnicas \nrecomendadas por el PMBOK: \na) Tormenta de Ideas (Brainstorming) \n●​ Sesiones colaborativas con todo el equipo del proyecto \n●​ Identificación de riesgos desde diferentes perspectivas (técnica, financiera, \noperativa) \n●​ Participación de los 6 miembros del equipo con roles complementarios \nb) Análisis SWOT/FODA \n●​ Fortalezas: Equipo multidisciplinario, tecnología IoT disponible, mercado objetivo \namplio \n●​ Oportunidades: Creciente población adulta mayor, interés en tecnologías de salud \n●​ Debilidades: Equipo estudiantil sin experiencia previa en dispositivos médicos \n●​ Amenazas: Regulaciones médicas estrictas, competencia de grandes empresas \nc) Revisión de Documentación \n●​ Análisis de proyectos similares de dispositivos IoT médicos \n●​ Revisión de estadísticas del CDC sobre polimedicación \n●​ Estudio de normativas COFEPRIS, FDA y CE para dispositivos médicos \nd) Entrevistas con Expertos \n●​ Consulta con profesionales de salud sobre necesidades reales \n●​ Asesoría técnica en IoT y desarrollo de hardware \n●​ Retroalimentación de potenciales usuarios (adultos mayores y cuidadores) \n \ne) Análisis de Supuestos \n●​ Supuesto: Los adultos mayores aceptarán usar tecnología → Riesgo R6 \n●​ Supuesto: Conectividad estable en hogares → Riesgo R9 \n●​ Supuesto: Disponibilidad de componentes electrónicos → Riesgo R3, R5 \nf) Listas de Verificación (Checklists) \n●​ Checklist de riesgos técnicos en proyectos IoT \n●​ Checklist de riesgos regulatorios en dispositivos médicos \n●​ Checklist de riesgos de gestión de proyectos \n2.2 Categorías de Riesgos Identificados \nSe han identificado 9 riesgos principales distribuidos en 6 categorías: \nA. RIESGOS TÉCNICOS (3 riesgos) \nR1 - Fallo en la comunicación IoT \n●​ Causa: Interferencias electromagnéticas, problemas de red, fallas de hardware \n●​ Evento: App móvil y pastillero no se sincronizan correctamente \n●​ Efecto: Pérdida de datos, notificaciones fallidas, desconfianza del usuario \n●​ Trigger: Tasa de desconexión > 5%, reportes de usuarios sobre falta de \nsincronización \nSolución:Para garantizar la confiabilidad del sistema de comunicación, implementaremos \nuna arquitectura híbrida que combine WiFi y Bluetooth, respaldada por colas de mensajes \ncon reintentos automáticos según los patrones de diseño para sistemas IoT resilientes. El \ndispositivo contará con almacenamiento local que permitirá sincronización posterior en caso \nde pérdida temporal de conexión, mientras que indicadores visuales claros informarán al \nusuario sobre el estado de la conectividad en todo momento. Esta solución multicapa \nasegura que ningún dato crítico se pierda y que el sistema permanezca funcional incluso \nante fallos intermitentes de red, proporcionando la robustez necesaria para un dispositivo de \nmonitoreo de salud. \nR2 - Batería defectuosa o baja duración \n●​ Causa: Componentes de baja calidad, consumo energético no optimizado \n●​ Evento: Pastillero se apaga antes del tiempo esperado (< 7 días) \n●​ Efecto: Pérdida de alertas, baja confiabilidad del dispositivo \n●​ Trigger: Duración de batería < 85% de lo especificado en pruebas \nSolución:Abordaremos el desafío energético mediante una estrategia integral que incluye \nla implementación de modos de sueño profundo entre operaciones y la selección de \nbaterías de litio-polímero de alta densidad energética. Realizaremos mediciones reales para \ndiseñar un perfil de consumo optimizado que maximice la autonomía del dispositivo. Esta \ncombinación de optimización de software y hardware adecuado garantiza que el dispositivo \nmantenga operatividad continua sin generar preocupación en los usuarios sobre la batería. \nB. RIESGOS FINANCIEROS (1 riesgo) \nR3 - Sobrecostos en componentes electrónicos \n●​ Causa: Aumento de precios en mercado global, escasez de semiconductores \n●​ Evento: Costo de prototipado supera el presupuesto estimado \n●​ Efecto: +15% del presupuesto original, necesidad de recortes \n●​ Trigger: Cotizaciones de proveedores > 10% del precio estimado \nSolución: Mitigaremos la volatilidad de precios en componentes mediante una estrategia de \ncadena de suministro diversificada que incluye acuerdos con múltiples proveedores. \nMantendremos un buffer presupuestario del 15% para absorber fluctuaciones de mercado e \nimplementaremos un programa de pre-compra para componentes críticos que nos permita \naprovechar precios favorables y asegurar disponibilidad. Este enfoque proactivo de gestión \nfinanciera y de suministro protege el proyecto contra disrupciones del mercado y mantiene \nlos costos controlados dentro de márgenes predecibles. \nC. RIESGOS OPERATIVOS (2 riesgos) \nR4 - Retraso en desarrollo de aplicación móvil \n●​ Causa: Complejidad técnica subestimada, problemas de compatibilidad iOS/Android \n●​ Evento: Entregables de app móvil se retrasan \n●​ Efecto: +4 semanas al cronograma (22% de incremento) \n●​ Trigger: Desviación del cronograma > 1 semana en fase de desarrollo \nSolución: Para asegurar entregas puntuales del desarrollo móvil, utilizaremos frameworks \ncross-platform como React Native o Flutter que permiten desarrollo simultáneo para iOS y \nAndroid, reduciendo significativamente los tiempos ,además el prototipado rápido y pruebas \nde usabilidad tempranas nos permitirán detectar y corregir problemas antes de que se \nconviertan en retrasos costosos. \nR5 - Dependencia de proveedor de ensamblaje externo \n●​ Causa: Único proveedor contratado tiene problemas operativos o financieros \n●​ Evento: Retrasos en entrega de prototipos ensamblados \n●​ Efecto: Extensión del cronograma, imposibilidad de realizar pruebas a tiempo \n●​ Trigger: Proveedor notifica retrasos o incumplimientos de SLA \nSolución: Eliminaremos el riesgo de dependencia única mediante la calificación y \ncontratación de al menos dos proveedores de ensamblaje, respaldados por acuerdos de \nnivel \nde \nservicio \n(SLA) \ncon \npenalizaciones \nclaras \nque \nincentiven \nel \ncumplimiento.mantendremos un inventario de seguridad de componentes críticos y \ndesarrollaremos capacidad limitada de ensamblaje interno para situaciones de emergencia \no producciones piloto. Esta redundancia operativa garantiza continuidad de producción ante \ncualquier fallo o incumplimiento de un proveedor específico, protegiendo los plazos de \nentrega al mercado. \n \nD. RIESGOS DE MERCADO (1 riesgo) \nR6 - Baja adopción por parte de adultos mayores \n●​ Causa: Complejidad percibida, resistencia al cambio tecnológico, miedo a \ndispositivos \n●​ Evento: Usuarios objetivo rechazan o abandonan el uso del sistema \n●​ Efecto: Fracaso comercial del producto, inversión sin retorno \n●​ Trigger: Tasa de abandono > 30% en pruebas piloto, satisfacción < 60% \nSolución:Ofreceremos soporte telefónico especializado 24/7 operado por personal \nentrenado en comunicación con adultos mayores, y cada dispositivo incluirá un kit de inicio \ncon guías visuales y setup asistido que simplifique la primera experiencia. Este enfoque \nholístico que combina diseño accesible con soporte humano cercano elimina las barreras \ntecnológicas típicas que enfrentan los adultos mayores, transformando la tecnología en una \nherramienta amigable y confiable. \nE. RIESGOS DE RECURSOS HUMANOS (1 riesgo) \nR7 - Rotación de personal clave del equipo \n●​ Causa: Graduación, ofertas laborales externas, insatisfacción, carga académica \n●​ Evento: Miembro clave abandona el proyecto (especialmente líderes técnicos) \n●​ Efecto: Pérdida de conocimiento, retrasos, errores por falta de experiencia \n●​ Trigger: Expresión de intención de salida, ausencias frecuentes, baja participación \nSolución:Mantendremos documentación exhaustiva de procesos y arquitectura que facilite \nla incorporación de nuevos miembros, mientras que un plan de desarrollo profesional \nvinculado al proyecto incentivará la permanencia del talento clave al ofrecer crecimiento \nsignificativo. Los acuerdos de confidencialidad y no competencia protegerán la propiedad \nintelectual desarrollada, asegurando que la inversión en capacitación no beneficie a \ncompetidores directos. \nF. RIESGOS EXTERNOS (2 riesgos) \nR8 - Cambios en normativas de dispositivos médicos \n●​ Causa: Actualización de regulaciones COFEPRIS, FDA o CE durante el desarrollo \n●​ Evento: Nuevos requisitos legales no contemplados inicialmente \n●​ Efecto: Necesidad de rediseño, sobrecostos, retrasos en certificación \n●​ Trigger: Publicación de nuevas normas NOM, directivas europeas o guías FDA \nNos adelantamos a cambios regulatorios mediante la participación activa en asociaciones \ndel sector que nos mantendrán informados sobre tendencias normativas, siguiendo la guía \nde la FDA sobre control de diseño. Nuestro diseño modular permitirá adaptaciones rápidas \nante nuevos requisitos sin necesidad de rediseño completo, mientras que la consultoría \nespecializada en regulación médica validará continuamente nuestro cumplimiento. Esta \nvigilancia regulatoria proactiva y arquitectura adaptable nos permite responder ágilmente a \ncambios normativos, convirtiendo una potencial amenaza en una ventaja competitiva sobre \nempresas menos preparadas. \nR9 - Fallas de conectividad en usuarios finales \n●​ Causa: Infraestructura de internet deficiente en hogares objetivo \n●​ Evento: Sistema no puede sincronizar con servidor en la nube \n●​ Efecto: Funcionalidad reducida, notificaciones fallidas \n●​ Trigger: > 20% de usuarios reportan problemas de conexión \nAdemás de las soluciones técnicas previamente descritas, estableceremos alianzas \nestratégicas con proveedores de internet para ofrecer planes especiales a nuestros \nusuarios. Desarrollaremos una versión básica con funcionalidad offline completamente \nautónoma para usuarios en zonas con conectividad limitada. \n \n2.3 Resumen Cuantitativo de Riesgos Identificados \nCategoría \nCantidad \nPorcentaje \nTécnicos \n3 \n33% \nFinancieros \n1 \n11% \nOperativos \n2 \n22% \nMercado \n1 \n11% \nRRHH \n1 \n11% \nExternos \n1 \n11% \nTOTAL \n9 \n100% \n2.4 Triggers y Señales de Alerta Temprana \nEl equipo de proyecto monitoreará las siguientes señales para activar respuestas: \nSeñales Técnicas: \n●​ Tasa de fallos en pruebas > 5% \n●​ Duración de batería < 90% especificación \n●​ Latencia de sincronización > 3 segundos \nSeñales Financieras: \n●​ Cotizaciones > 10% del presupuesto \n●​ Desviación acumulada > 8% \nSeñales Operativas: \n●​ Retrasos > 1 semana en entregables \n●​ Proveedores con calificación < 4/5 \nSeñales de Mercado: \n●​ Satisfacción en piloto < 70% \n●​ Tasa de abandono > 25% \nSeñales de RRHH: \n●​ Ausencias no justificadas \n●​ Disminución en calidad de entregables \nSeñales Externas: \n●​ Anuncios de cambios regulatorios \n●​ Problemas reportados en zona de pruebas \n3. Registro de Riesgos (Risk Register) \nID \nCategorí\na \nCausa \nEvento \n(Riesgo) \nEfecto en el \nProyecto \nProb. \nIm\npa\ncto \nNivel \nEstrategia \nResponsable \nEstado \nR1 \nTécnico \nFallo en la \ncomunicac\nión IoT \nApp \ny \npastillero \nno \nse \nsincroniz\nan \nRetrasos, \npérdida de \nconfianza \nM \nA \nCrític\no \nMitigar: \npruebas \ntempranas \ny \nredundanci\na \nBluetooth \n+ WiFi \nJahir \nFlores \nZaragoza \n(Líder \nFirmware) y David \nAlejandro \nToledo \nDurán (Líder HW) \nAbierto \nR2 \nTécnico \nComponen\ntes \ndefectuoso\ns \no \nbaja \nbatería \nPastillero \nse apaga \nantes \nde \nlo \nesperado \nBaja \nconfiabilida\nd \nM \nM \nModer\nado \nMitigar: \ncontrol de \ncalidad \ny \nmejores \nproveedore\ns \nDavid Toledo Durán \n(Líder HW) \nAbierto \nR3 \nFinancie\nro \nAumento \nde precios \nelectrónico\ns \nSobrecost\nos \nen \nprototipa\ndo \n+15% \npresupuest\no \nM \nM \nModer\nado \nTransferir: \ncontratos \nde \nprecio \nfijo \nSergio Uriel García \nHernández (Gerente \nde Proyecto) \nAbierto \n \n4. Matriz Probabilidad–Impacto \nClasificación de riesgos:​\n - Críticos (zona roja): R1, R4, R5, R6​\n - Altos (zona naranja): R8​\n - Moderados (zona amarilla): R2, R3, R7, R9​\n - Bajos (zona verde): Ninguno \n​\n​\n \n \n \n \n \n \n \n \nR4 \nOperativ\no \nComplejida\nd \nen \ndesarrollo \napp \nRetraso \nen \nentregabl\nes \n+4 semanas \n(22% \ncronograma\n) \nA \nA \nCrític\no \nMitigar: \nmodulariza\nción \ny \nentregas \nparciales \nOsvaldo \nJuarez \nTlamani (Líder App \nMóvil) \nAbierto \nR5 \nOperativ\no \nDependenc\nia \nde \nensamblaje \nexterno \nRetrasos \nde \nproveedor \nExtensión \nde \ncronograma \nM \nA \nCrític\no \nTransferir: \ncontrato \nSLA, \nproveedor \nalterno \nSergio Uriel García \nHernández (Gerente \nde Proyecto) \nAbierto \nR6 \nMercad\no \nPoca \naceptación \nadultos \nmayores \nBaja \nadopción \nRiesgo \ncomercial \nM \nA \nCrític\no \nMitigar: \npruebas \npiloto \ny \nmarketing \ndirigido \nMaría \nFernanda \nAguas \nRojas \ny \nIsrael \nIgnacio \nCalderón \nPaisano \n(Analistas \nde \nNegocio) \nAbierto \nR7 \nRRHH \nRotación \nde \npersonal \nclave \nPérdida \nde \nconocimi\nento \nRetrasos y \nerrores \nB \nM \nModer\nado \nMitigar: \ndocumenta\nción, \ntransferenc\nia \nde \nconocimie\nnto \nSergio Uriel García \nHernández (Gerente \nde Proyecto) \nAbierto \nR8 \nExterno \nCambio \nnormativas \nmédicas \nNuevos \nrequisitos \nlegales \nRediseño, \nsobrecosto\ns \nB \nA \nAlto \nAceptar/Mit\nigar: \nmonitoreo \nregulatorio \ny asesoría \nlegal \nMaría \nFernanda \nAguas \nRojas \ny \nIsrael \nIgnacio \nCalderón \nPaisano \n(Analistas \nde \nNegocio) \nAbierto \nR9 \nExterno \nFallas \nde \nconectivid\nad \nen \nusuarios \nSin \nsincroniz\nación \nremota \nNotificacion\nes fallidas \nM \nM \nModer\nado \nMitigar: \nmodo \noffline con \nalertas \nlocales \nJahir \nFlores \nZaragoza \n(Líder \nFirmware) \nAbierto \n \n \n La matriz de probabilidad–impacto se representa de forma visual en el análisis, donde se \nobserva la ubicación de cada riesgo según su probabilidad y su impacto. \n5. Estrategia de Monitoreo \n• Reuniones quincenales de riesgos.​\n • Actualización del Registro de Riesgos tras cada fase.​\n • Revisión de supuestos y controles de calidad en cada hito.​\n • Documentar lecciones aprendidas para futuros proyectos. \n¡Por supuesto! Aquí tienes una versión más extendida y detallada de las conclusiones, \nelaborada a partir de la información del documento. \n \nConclusiones \nEl proyecto \"Pastillero Inteligente\" concluye su fase de planificación presentándose como \nuna solución integral y robusta, diseñada para responder de manera efectiva a la \nproblemática de salud pública que representa la polimedicación en adultos mayores. La \ninvestigación inicial y la conformación de la idea han validado la necesidad crítica de una \nherramienta que mejore la adherencia terapéutica, y los estudios de viabilidad y factibilidad \nconfirman que la propuesta es alcanzable y pertinente. Se ha determinado que el proyecto \nes viable gracias a la disponibilidad de tecnología de bajo costo y a la existencia de un \nmercado amplio con una necesidad social clara. Asimismo, es factible porque se basa en la \nimplementación de componentes ya existentes y en un diseño centrado en el usuario, lo que \ngarantiza su facilidad de uso y adaptación a las rutinas de los pacientes y cuidadores. \nLa fortaleza principal del proyecto reside en su exhaustiva y meticulosa planificación, que \nabarca todas las áreas de gestión fundamentales. El cronograma de 18 semanas, con hitos \nbien definidos, ofrece una hoja de ruta clara para la ejecución, desde el diseño hasta las \npruebas piloto con usuarios. La gestión de costos ha permitido establecer un presupuesto \nsimulado de $116,725 MXN, una inversión controlada que asegura la viabilidad económica \ndel desarrollo del prototipo. Además, la definición clara de roles y responsabilidades para \ncada miembro del equipo garantiza una cobertura completa de las áreas de hardware, \nsoftware, análisis y gestión, sentando las bases para un flujo de trabajo eficiente y \ncolaborativo. \nUn pilar fundamental de esta planificación ha sido la gestión proactiva de riesgos. Se \nidentificaron y analizaron sistemáticamente nueve riesgos principales, abarcando categorías \ntécnicas, financieras, operativas y de mercado. La clasificación de riesgos críticos como el \nretraso en el desarrollo de la aplicación móvil (R4), la dependencia de un proveedor externo \n(R5) o la baja adopción por parte de los usuarios (R6), ha permitido la formulación de \nestrategias de mitigación específicas antes de que estos puedan impactar el proyecto. Este \nenfoque realista y previsor es un factor clave que incrementa significativamente las \nprobabilidades de éxito. \nEn resumen, el proyecto \"Pastillero Inteligente\" trasciende la mera concepción de un \ndispositivo tecnológico para posicionarse como una iniciativa bien estructurada con un \nprofundo potencial de impacto social. Cumple con su misión de ofrecer una solución que \nbrinde seguridad a los pacientes y apoyo a sus cuidadores , y traza un camino claro hacia \nsu visión de futuro: ser una herramienta innovadora que reduce hospitalizaciones y aumente \nla autonomía y calidad de vida de los adultos mayores. La culminación exitosa de esta fase \nde planificación demuestra que el equipo posee no solo la capacidad técnica, sino también \nla madurez en gestión de proyectos necesaria para transformar esta idea en una realidad \ntangible y beneficiosa para la sociedad. \nEvaluación de madurez bajo CMMI \nNiveles del modelo CMMI \n1.​ Inicial - proceso improvisado, dependiente de personas. \n2.​ Gestionado - prácticas básicas documentadas, control de proyecto. \n3.​ Definido - procesos estandarizados, institucionalizados. \n4.​ Cuantitativamente gestionado - gestión basada en datos y métricas. \n5.​ Optimizado - mejora continua y análisis predictivo. \n \nMetodología de evaluación \nLa evaluación se realizó mediante un análisis del documento, comparando la evidencia \ndisponible contra los requisitos del modelo CMMI. Se utilizaron criterios como \ndocumentación, estandarización, métricas, control cuantitativo y mejora continua. \n \nEvaluación del proceso: Gestión de Riesgos \n \nRequisito CMMI \nEvidencia \nCumplimiento \nNivel 2: Documentación \nMetodología formal PMBOK \nSi \nNivel 3: Estandarización \nTécnicas estructurales: \nFODA, entrevistas \nSi \nNivel 4: Métricas \nKPIs, triggers, matriz \nprob-impacto \nSi \nNivel 5: Mejora continua \nNo hay ciclos históricos \nParcial \n \nNivel asignado: 4 - Cuantitativamente Gestionado \n \nEvaluación del proceso: Gestión de Calidad \n \nRequisito CMMI \nEvidencia \nCumplimiento \nNivel 2: Documentación \nKPIs, plan de pruebas \nSi \nNivel 3: Estandarización \nRevisión semanales, Git \nSi \nNivel 4: Control cuantitativo \nNo existen mediciones \nreales \nNo \nNivel 5: Mejora continua \nSin tendencias ni \nretroalimentación iterativa \nNo \n​\n \nNivel asignado: 3 - Definido \n \nRecomendaciones para subir de nivel \n \nGestión de riesgos \n-​\nImplementar análisis histórico de tendencias. \n-​\nRealizar ciclos formales de retroalimentación. \n-​\nIncorporar dashboards automáticos para KPIs. \n-​\nIntegrar análisis predictivo. \n \nGestión de calidad \n-​\nRegistrar datos del desempeño. \n-​\nImplementar métricas estadísticas. \n-​\nUsar control estadístico de procesos. \n-​\nDocumentar lecciones aprendidas. \n \nComparación de Madurez \n \nCriterio \nRiesgos \nCalidad \nNivel CMMI  \n4 \n3 \nDocumentación \nAlta \nAlta \nMétricas \nSi \nParcial \nMejora continua \nParcial \nNo \n \nConclusión  \nEl proceso de Gestión de Riesgos demuestra una madurez superior al alcanzar el nivel 4 \ndel modelo CMMI, debido a su estructura basada en datos, triggers, monitoreo continuo y \nestrategias definidas. Por su parte, Gestión de Calidad se ubica en el nivel 3, ya que está \ndocumentado y estandarizado, pero aún carece de mediaciones cuantitativas y control \nestadístico. Ambos procesos presentan un desarrollo adecuado, destacando la robustez del \nproceso de riesgos. \n \n \n \n \n \n \nMatrices RACI del proyecto \n \nMatriz RACI - proceso 04 Definir los procesos, Organización y \nRelaciones de TI \n \n \nJustificación de Asignaciones \n●​ Responsable (R): Líder de Software/Firmware y Líder de Apps Móviles. \n○​ Ambos son los responsables de desarrollar el código y, por lo tanto, son los \nencargados directos de definir el marco de trabajo (lenguajes, frameworks, \nestándares de codificación, herramientas de control de versiones como Git) \npara sus respectivas áreas (firmware embebido y aplicación móvil). \n●​ Aprobador (A): Gerente de Proyecto (Sergio Uriel). \n○​ El Gerente de Proyecto aprueba el marco de trabajo, asegurando que los \nestándares definidos se alineen con el cronograma de 18 semanas, el \npresupuesto de costes y la capacidad general del equipo. \n●​ Consultados (C): Líder de Hardware y Analistas de Negocio/Calidad. \n○​ El Líder de Hardware es consultado para asegurar que el marco de trabajo \nde \nsoftware \nsea \ncompatible \ncon \nla \nconectividad \ny el hardware \n(Bluetooth/WiFi, bajo consumo). \n○​ Los Analistas de Negocio/Calidad son consultados para asegurar que el \nmarco incluya los procesos de pruebas de calidad necesarios para cumplir \ncon los KPI de confiabilidad. \n \n \nJustificación de la Actividad: Diseñar Marco de Trabajo \npara el Proceso de TI \nEsta actividad es la base de la Planificación de la Calidad y la ejecución técnica. Se \njustifica su inclusión porque define la estructura técnica que asegurará el cumplimiento de \nlos requerimientos y la mitigación de riesgos operativos. \n1. Soporte a la Ejecución Técnica y Calidad (¿Cómo aseguramos la \nconfiabilidad?) \n●​ Definición de Estándares de Calidad: Esta tarea define los estándares de \ndesarrollo que se utilizarán para cumplir los Requerimientos No Funcionales (ej., \nInterfaz simple e intuitiva y Conectividad segura). Un marco de trabajo claro \nasegura que el código sea revisable y escalable. \n●​ Alineación con el Prototipado: Al definir el marco, se seleccionan las herramientas \nque permitirán una Programación del firmware eficiente y un Desarrollo de la \naplicación móvil rápido, lo cual es crucial para encajar estas tareas en el tiempo \najustado de 6 y 4 semanas respectivamente, dentro del cronograma de 18 \nsemanas. \n2. Mitigación del Riesgo Operativo y Técnico \n●​ Respuesta al Riesgo R4 (Retraso en desarrollo de aplicación móvil): Un marco \nde trabajo bien definido, que incluye el uso de metodologías ágiles y herramientas \nde control de versiones (Git), previene la \"complejidad técnica subestimada\" al \nestandarizar el proceso y permitir la modularización de entregables parciales. \n●​ Respuesta al Riesgo R1 (Fallo en la comunicación IoT): El marco de trabajo \nobliga a los líderes técnicos a establecer protocolos de comunicación y redundancia \n(Bluetooth + WiFi) desde la fase de diseño, lo cual es la estrategia de mitigación de \neste riesgo. \n3. Impacto en la Gestión de Costes \n●​ Justificación de Coste de Software: La definición del marco de trabajo justifica la \ninversión en Plataformas de Desarrollo (3,500 MXN), ya que se seleccionan \nexplícitamente las licencias o servicios necesarios para las herramientas de diseño \nUI/UX y la plataforma multiplataforma (Flutter/React Native) que serán utilizadas por \nlos responsables (R) del diseño. \n \n \n \n \n \n \nMatriz RACI - P07 Administrar los Recursos Humanos de TI \n \nJustificación de Asignaciones \n●​ Identificación de Habilidades y Benchmarks: \n○​ Responsable (R): Analistas de Negocio/Calidad (Maria Fernanda y Israel). \nSu rol de Analista de Negocio es recopilar información, definir los KPIs y \nrealizar la investigación de mercado y de capital humano para establecer los \nbenchmarks. \n○​ Aprobador (A): El Gerente de Proyecto (Sergio Uriel) aprueba formalmente \nlas descripciones de puestos y los rangos salariales simulados, ya que es el \ndueño final de la gestión del presupuesto (Costes). \n \nJustificación \nde \nla \nActividad: \nIdentificación \nde \nHabilidades \ny \nBenchmarks \nEsta actividad es esencialmente la Planificación de los Recursos Humanos del proyecto. \nSe justifica su inclusión porque, aunque el proyecto no es real, la documentación debe \nreflejar los pasos necesarios para garantizar la calidad y la competitividad del equipo. \n1. Soporte a la Viabilidad y Competitividad del Proyecto \n●​ Fundamento de Viabilidad: Para que el proyecto sea viable, debemos demostrar \nque la empresa puede atraer y retener el talento necesario. Identificar las \nhabilidades de TI (como la programación embebida, el desarrollo multiplataforma y \nla arquitectura en la nube) es crucial para confirmar que el proyecto es técnicamente \nrealizable con personal real. \n●​ Definición de Benchmarks: La investigación sobre benchmarks y salarios \nestablece el coste simulado del recurso humano, validando la sección de Gestión \nde Costes (Recursos Humanos: 54,000 MXN ) y asegurando que la estimación sea \ncreíble y competitiva en el sector tecnológico. \n2. Base para la Evaluación y el Desarrollo del Personal \n●​ Definición de Roles de Calidad: Esta actividad garantiza que las descripciones \nde puesto sean claras y estén alineadas con los objetivos de calidad del proyecto. \nEsto incluye definir los requisitos para la interfaz simple e intuitiva (para el \nDiseñador \nde \nUI/UX) \ny \nla \nconectividad \nsegura \n(para \nel \nLíder \nde \nSoftware/Firmware). \n●​ Soporte a Planes de Carrera: La matriz RACI y esta actividad sirven de base para \nel Plan de Carrera de Personal. Al identificar las habilidades actuales y las \nnecesidades de desarrollo, el proyecto puede justificar el entrenamiento y la \npromoción futura, cumpliendo el objetivo de preparar a los integrantes para roles \navanzados en el mercado laboral. \n3. Mitigación del Riesgo de Recursos Humanos \n●​ Respuesta al Riesgo R7: Esta planificación de personal es una respuesta proactiva \nal Riesgo R7 - Rotación de personal clave del equipo. Al definir rangos \ncompetitivos y un plan de desempeño (benchmarks), se minimiza la causa de la \nrotación (insatisfacción o baja participación ), aumentando la probabilidad de \nretener el conocimiento esencial y evitar retrasos y errores. \n \nMatriz RACI - P10 Administrar proyectos \n \nJustificación de Asignaciones \n●​ Responsable (R): Gerente de Proyecto (Sergio Uriel). \n○​ Como líder general, el Gerente de Proyecto es el responsable directo de la \ncomunicación con las partes interesadas y de gestionar la alineación del \nproyecto con la Misión y Visión. Su rol principal es asegurar que el equipo \nesté coordinado y que los stakeholders externos (cuidadores, docentes, \nposibles inversionistas) se mantengan comprometidos. \n●​ Aprobador (A): Analistas de Negocio/Calidad (Maria Fernanda y Israel). \n○​ Los Analistas de Negocio son los dueños de la recopilación de \nrequerimientos y tienen el conocimiento más profundo de las necesidades \nde los usuarios (adultos mayores y cuidadores). Por lo tanto, aprueban que \nlas estrategias de comunicación y el nivel de compromiso sean suficientes \npara que el producto final tenga éxito en el mercado. \n●​ Consultado (C): Líder de Hardware/Electrónica. \n○​ Se consulta al Líder de Hardware sobre la capacidad técnica de cumplir con \nlas expectativas del mercado (ej. Bajo consumo de energía, durabilidad). Su \nfeedback es crucial para no prometer características que el hardware no \npueda entregar. \n●​ Informado (I): Líder de Software/Firmware y Líder de Apps Móviles. \n○​ Los líderes de desarrollo son informados sobre el estado de la participación \nde los interesados para que puedan priorizar tareas y entender cómo el \nfeedback del mercado impacta el desarrollo de las funcionalidades. \nJustificación de la Actividad: Asegurar la Participación y Compromiso \nEsta actividad se justifica porque el éxito del Pastillero Inteligente es inherentemente social, \ndependiendo de la adopción por parte de un público sensible (adultos mayores) y del apoyo \nde los cuidadores. \n1. Soporte a la Comunicación y Alcance del Proyecto \n●​ Alineación de Expectativas: Asegurar el compromiso es la base de la Gestión de \nComunicaciones. Esta tarea define el flujo de información para las Presentaciones \nde Avance y el Material de Marketing Inicial, asegurando que el mensaje del \nproyecto sea claro. \n●​ Diseño Centrado en el Usuario: La actividad valida la estrategia de Diseño \ncentrado en el usuario con pruebas piloto en adultos mayores (Estrategia). El \ncompromiso de los usuarios y cuidadores es vital para obtener el feedback necesario \nen las Pruebas piloto y garantizar que la interfaz simple e intuitiva sea realmente \nefectiva. \n2. Mitigación del Riesgo de Mercado y Calidad \n●​ Respuesta al Riesgo R6 (Baja adopción por parte de adultos mayores): Esta \nplanificación es una respuesta directa al riesgo de fracaso comercial. Al asegurar la \nparticipación desde el inicio, se mitiga la causa (la \"resistencia al cambio \ntecnológico\" y la \"complejidad percibida\"), aumentando la tasa de satisfacción \ndel usuario (KPI) y evitando que la Tasa de abandono sea > 30% (Trigger de \nRiesgo). \n●​ Compromiso con la Calidad: Al incluir a los interesados en el proceso, se fortalece \nel cumplimiento de los Requerimientos de Dominio (ej. Integración con \nnecesidades de cuidadores y personal de salud), lo que es un componente clave \npara la calidad del producto final. \n \n \nMitigación del Riesgo de Mercado y Calidad \n \n \n \n \n \nGestión de servicios de itil  \nConcepto \nDefinición \nITIL \nSe define como el conjunto de buenas prácticas que ayudan en la \ngestión de un servicio, en particular un servicio de TI, su objetivo es \nalinear los servicios de TI con las necesidades del negocio mejorando \nasí la calidad y satisfacción del usuario. \nIncidente \nCualquier interrupción no planificada o reducción en la calidad de un \nservicio de TI. \n¿Cuándo un \nincidente se \nconvierte en un \nproblema? \n·        Se repite frecuentemente. \n·        Afecta a muchos usuarios. \n·        Requiere investigación profunda para evitar que vuelva a ocurrir. \n·        Genera un impacto significativo en el negocio. \nSu causa raíz es desconocida. \nValor \nEs la importancia, utilidad y beneficio que un servicio proporciona al \ncliente, generalmente se mide en términos de objetivos logrados. \nUn servicio solo tiene valor si el cliente percibe que le ayuda a lograr \nsus objetivos. \nChange \nManagement \nProceso responsable de controlar el ciclo de vida de todos los \ncambios en los servicios de TI. Su objetivo es minimizar el riesgo y el \nimpacto negativo que un cambio pueda causar en los servicios \nactivos. \nChange \nEs cualquier modificación en servicios de TI que puede afectar el \nfuncionamiento del sistema. \nRFC \nEs la solicitud formal para implementar un cambio, contiene detalles \nsobre el cambio como su impacto, riesgos y plan de implementación. \nService \nMedio para entregar valor al cliente facilitando los resultados que \nquieren lograr sin que el cliente deba gestionar costos o riesgos \nespecíficos. \nChange \nManagement \nProcess \nSe refiere al flujo de trabajo específico que sigue un cambio (RFC) \ndesde su creación hasta su cierre. Típicamente incluye pasos como: \nRegistro, Evaluación y Autorización (evaluando riesgo e impacto), \nPlanificación, Implementación y Revisión. \nIncident \nManagement \nEs la práctica responsable de gestionar todos los incidentes. Su \nobjetivo principal es restaurar la operación normal del servicio lo más \nrápido posible y minimizar el impacto adverso en las operaciones del \nnegocio. \nProblema \nManagement \nEs la práctica responsable de gestionar todos los problemas. Su \nobjetivo es identificar la causa raíz de los incidentes, encontrar \nsoluciones (temporales o definitivas) y prevenir que los incidentes \nocurran o se repitan. \nOperation \nManagement \nSe refiere a la Gestión de Operaciones de TI. Es la función que se \nencarga de supervisar y controlar la infraestructura y los servicios de \nTI en el día a día. Se asegura de que todo funcione de manera \nestable y predecible. \nConfiguration Item \nUn Elemento de Configuración (CI) es cualquier activo o componente \n(hardware, software, documentación, personal) que necesita ser \ngestionado para poder entregar un servicio de TI. Los CIs y sus \nrelaciones se registran en una Base de Datos de Gestión de la \nConfiguración (CMDB). \nProcesos y actividades de atención de Change Management  \nFASE \nNOMBRE DEL \nPROCESO \nACTIVIDADES \n1 \nInicialización \n1. Preguntas clave de ingeniería de software (RFC - Request For \nChange): \na) ¿Qué? (El cambio): Añadir una pantalla LCD/OLED de bajo \nconsumo al pastillero físico para mostrar la hora actual, el nombre \ndel medicamento próximo y la dosis, reduciendo la dependencia de \nla app móvil para la información inmediata. \nb) ¿Cuándo? (Implementación) \nIdealmente, debe integrarse durante la Fase de Desarrollo y Pruebas \n(Semanas 9-16) para ser incluido en el prototipo funcional del Hito 3. \nc) ¿Por qué? (Justificación) \nMitigar directamente el Riesgo R6 (Baja adopción) en adultos \nmayores, ya que mejora la interfaz simple e intuitiva al mostrar la \ninformación crítica directamente en el dispositivo, alineándose con el \nDiseño centrado en el usuario. \nd) ¿Quién? (Solicitante) \nAnalistas de Negocio y Calidad (María Fernanda e Israel), \nbasándose en la Simulación de la Satisfacción en Piloto < 70% (una \nseñal de monitoreo). \ne) ¿Para quién? (Beneficiario)Adultos mayores (usuario final) y \nCuidadores (quienes lo gestionan). \n2. Delegar RFC: Se asigna al Gerente de Proyecto (Sergio García) \npara su análisis formal. \n  \n2 \nDiseño del \nservicio \nEvaluación de riesgo y urgencia del RFC:El cambio se clasifica como \nde Impacto Alto (requiere modificar hardware y firmware) y Urgencia \nMedia-Alta (es clave para la adopción/Riesgo R6). \nCreación de ticket para RFC: \nSe registra formalmente en el sistema de gestión del proyecto, \nvinculándolo al Riesgo R6 y al Requerimiento No Funcional de Bajo \nConsumo de Energía (para asegurar que la pantalla sea eficiente). \n  \nChequeo operativo del cambio con Matriz de Riesgos: \nSe activa la revisión del Líder de Hardware (David Toledo) para \nevaluar el impacto: Aumenta el Costo Detallado del Hardware (se \nestima un 5% extra en componentes), requiere más Programación \ndel Firmware (manejo de la pantalla) e impacta la Duración de la \nBatería (Riesgo R2, que ahora podría tener mayor Probabilidad). \n  \nNuevo Objetivo de Cambio: Aumentar la tasa de Satisfacción del \nUsuario al 90% en la interacción inicial con el hardware. \nKPI del Cambio: Reducción del 50% en las consultas sobre \"qué \ntomar\" durante las Pruebas Piloto con Usuarios (actualmente 1 \nsemana). \n  \n3 \nPlanificación \nCaracterización del cambio (7 R’s de Change Management): Razón: \nMitigar la baja adopción (R6). Riesgo: Aumento de costo (Riesgo \nFinanciero) y impacto en el firmware (R1). Recursos: Requiere \ntiempo \nadicional \ndel Líder de Hardware y del Líder de \nFirmware.Autorización del cambio: \nEl Gerente de Proyecto (Aprobador de Costes) autoriza el gasto \nadicional, entendiendo que es una mitigación crítica. \nMatrices RACI: \nSe actualiza la RACI para la actividad \"Diseño del prototipo de \nhardware\". El Líder de Hardware (David Toledo) es el R \n(Responsable), el Líder de Firmware (Jahir Flores) es C \n(Consultado) y el Gerente de Proyecto (Sergio García) es el A \n(Aprobador). \nGestión de comunicaciones: \nSe emite un Reporte de Avance Semanal extraordinario para \ninformar a todo el equipo sobre la modificación del alcance (scope \ncreep) y su justificación estratégica. \nSeguimiento y control: \nSe prioriza la revisión del consumo de energía del ESP32 en los \nmodos deep-sleep con la nueva pantalla para no incumplir el \nRequerimiento No Funcional de Bajo consumo de energía. \nCalendarización del cambio (Gráfica de Gantt): \nSe extiende la actividad \"Diseño del prototipo de hardware\" (3 \nsemanas) a 4 semanas y se añade una semana al \"Programación \ndel firmware del pastillero\" (6 semanas) para integrar el driver de la \npantalla. El Hito 3 se desplaza una semana. \n  \n4 \nValidación del \ncambio \nRevisión de KPI’s: \nDurante las Pruebas piloto con usuarios, se realizan encuestas \nespecíficas para medir la Satisfacción del usuario con la nueva \npantalla. Se verifica que las consultas sobre \"qué tomar\" se hayan \nreducido según el objetivo establecido. \n  \n5 \nImplementación \ndel cambio \nProceso PDCA (Planificar, Hacer, Verificar, Actuar): Hacer: El Líder \nde Hardware suelda la pantalla; el Líder de Firmware sube el código \nnuevo al ESP32. \nVerificar: El Analista de Calidad ejecuta Pruebas de integración del \nsistema para confirmar que la pantalla no genere fallos en la \nsincronización (R1) y que la batería aún cumpla con las \nespecificaciones (R2). \n  \n6 \nRevisión y \nliberación de \ncambios. \nHacer pruebas y documentación: \nSe documenta formalmente la decisión en el Registro de Riesgos \n(Risk Register), cerrando la mitigación del Riesgo R6. Se actualiza el \nCoste Detallado del Hardware y se incorpora la pantalla en las \nConclusiones finales y presentación del proyecto como una mejora \nclave de usabilidad. \n  \n \nDiagrama de flujo\n \nPreguntas Claras \n1. Integración de PMBOK y Alcance \n1.​ Validación del Alcance: El Pastillero Inteligente debe ser capaz de enviar \nnotificaciones a los cuidadores (Requerimiento Funcional). ¿Cómo se llama el \ndocumento clave del PMBOK que el Analista de Negocio debe usar para que \nel Líder de Desarrollo de Apps Móviles demuestre formalmente que esta \nfuncionalidad de notificación fue construida correctamente y que el cliente \n(simulado) la aceptó? \n2.​ Gestión del Cronograma: La actividad de Programación del Firmware se \nextendió de 6 a 7 semanas debido al cambio de la pantalla LCD. ¿Cómo se \nllama el documento central del PMBOK que el Gerente de Proyecto debe \nactualizar formalmente para reflejar este nuevo plazo? \n2. Calidad y Madurez (CMMI) \n3.​ Objetivo de Calidad: Nuestro Objetivo de Calidad es garantizar que el \npastillero funcione con un 90% de confiabilidad en las alertas. ¿Qué \nherramienta de Planificación de la Calidad (PMBOK) usaría el equipo para \ndeterminar si se necesita la certificación básica en un dispositivo médico? \n4.​ Madurez CMMI: Si nuestro equipo quiere alcanzar un nivel de madurez \nCMMI Nivel 2 (Gestionado), ¿qué proceso de gestión del proyecto debemos \ndocumentar, entrenar y seguir rigurosamente para garantizar que no \nvolvamos a cometer el mismo error de estimación de tiempo (R4: Retraso \nen desarrollo de aplicación móvil)? \n3. Gestión de Servicios (ITIL) \n5.​ Valor del Servicio: ¿Cuál es el Servicio que realmente entregamos al \ncliente (Cuidador) y cómo el cambio de la pantalla LCD impacta el Valor \npercibido por el Usuario (Adulto Mayor)? \n6.​ Tipos de Cambio: El proceso de añadir la pantalla LCD fue una solicitud \nformal. Describa brevemente la diferencia entre un Cambio Normal (RFC) y \nun Cambio de Emergencia (ITIL) en el contexto de nuestro proyecto (ej. \n¿Qué tipo de cambio sería un fallo de seguridad crítico en el servidor de \nnotificaciones?) \n \nCONCLUSIONES \nLa realización de este proyecto, consistente en el desarrollo de un sistema de \npastillero inteligente integrado con una aplicación móvil para combatir la \npolimedicación en adultos mayores, ha trascendido el mero ejercicio técnico de \nprogramación y electrónica. Nos ha permitido comprender que la viabilidad de una \nsolución tecnológica no depende únicamente de que \"el código funcione\" o el \ncircuito cierre, sino de una gestión estructurada que asegure calidad, seguridad y \nvalor para el usuario final. \nA continuación, presentamos nuestras reflexiones sobre la integración de las \nmetodologías de gestión y gobierno de TI en nuestro proceso de desarrollo: \nReflexión sobre PMBOK (Project Management Body of Knowledge) \nDesde la perspectiva académica, la implementación de los lineamientos del PMBOK \nfue fundamental para transformar una \"idea abstracta\" en un proyecto ejecutable. Al \ninicio, subestimamos la importancia de la Gestión del Alcance y la Gestión de \nRiesgos. Sin embargo, aplicar este estándar nos obligó a definir claramente qué no \nharía el sistema (limitándolo a recordatorios y no a dispensación médica crítica), lo \ncual salvó al equipo de comprometerse con funcionalidades inalcanzables en el \ncronograma de 18 semanas. PMBOK nos enseñó a respetar la \"Triple Restricción\" \n(Alcance, Tiempo y Costo), entendiendo que cualquier cambio en los requerimientos \nimpacta directamente en la calidad del entregable final. \nReflexión sobre ITIL (Information Technology Infrastructure Library) \nLa incorporación de ITIL cambió nuestro enfoque de \"crear un producto\" a \"proveer \nun servicio\". Académicamente, esto fue un punto de inflexión. Comprendimos que el \npastillero y la app no son el fin, sino el medio para entregar valor: la salud del \npaciente. Bajo la óptica de ITIL, nos enfocamos en el diseño del servicio (Service \nDesign) y la operación (Service Operation), priorizando la Alta Disponibilidad y la \ngestión de incidencias. Entendimos que, si el servidor en la nube falla o la batería se \nagota, el servicio se interrumpe y el valor para el usuario desaparece. ITIL nos dotó \ndel lenguaje necesario para planificar el soporte y la continuidad del servicio más \nallá de la entrega del prototipo. \nReflexión \nsobre \nCOBIT (Control Objectives for Information and Related \nTechnologies) \nAl tratar con datos sensibles de salud y dispositivos para adultos mayores, la \ngobernanza se volvió crítica. COBIT nos proporcionó el marco para alinear las \ntecnologías de la información con los objetivos del negocio (en este caso, la \nadherencia terapéutica). Nuestra reflexión académica es que COBIT actúa como el \n\"árbitro\" que asegura que la tecnología cumpla con las normativas y controles \nnecesarios. Nos ayudó a identificar que la seguridad de los datos médicos y la \nauditoría de los registros de consumo no son características opcionales, sino \nrequisitos de control obligatorios para mitigar riesgos legales y operativos en un \nentorno de salud. \nReflexión sobre CMMI (Capability Maturity Model Integration) \nFinalmente, CMMI nos ofreció una visión clara sobre la madurez de nuestros \nprocesos de desarrollo. Como estudiantes, a menudo operamos en un nivel de \nmadurez \"Inicial\" (caótico y dependiente del esfuerzo individual o heroico). La \nreflexión al estudiar CMMI es que, para profesionalizarnos, debemos aspirar al nivel \n\"Gestionado\" y posteriormente \"Definido\". Intentamos aplicar esto documentando \nnuestros procesos, estandarizando la forma en que escribimos código (backend y \nfirmware) y estableciendo pruebas de calidad recurrentes. CMMI nos enseñó que la \ncalidad del software es una consecuencia directa de la calidad de los procesos \nutilizados para crearlo. \nConclusión Final \nEn resumen, la integración académica de PMBOK, ITIL, COBIT y CMMI ha sido \nindispensable para dotar al proyecto de un carácter profesional. Hemos aprendido \nque: \n1.​ PMBOK administra el proyecto. \n2.​ ITIL administra el servicio. \n3.​ COBIT gobierna y controla. \n4.​ CMMI mejora la calidad del proceso. \nComo futuros ingenieros en TICs, estas metodologías ya no son conceptos teóricos \nabstractos, sino herramientas vivas que nos permitieron estructurar una solución \ncompleja (IoT, Móvil, Cloud) de manera eficiente, asegurando que el Pastillero \nInteligente sea no solo viable técnicamente, sino también sostenible, seguro y \nvalioso para la sociedad. \n \n \n \n \n \n \n \n \nReferencias  \n \n[1]Instituto Nacional de las Personas Adultas Mayores. (2024). Manual para la \nprevención y atención de caídas en personas adultas mayores [PDF]. Dirección de \nGerontología, \nGobierno \nde \nMéxico. \nhttps://www.gob.mx/cms/uploads/attachment/file/929765/08_MANUAL_PARA_LA_PREVEN\nCIO_N_Y_ATENCIO_N_DE_CAI_DAS_EN_PAMS_APA.pdf \n[2]Instituto Nacional de Salud Pública. (s. f.). Caídas en personas adultas mayores. \nInstituto \nNacional \nde \nSalud \nPública. \nhttps://www.insp.mx/avisos/caidas-en-personas-adultas-mayores \n[3]National Institute on Aging. (s. f.). The dangers of polypharmacy and the case for \ndeprescribing \nin \nolder \nadults. \nNational \nInstitutes \nof \nHealth. \nhttps://www.nia.nih.gov/news/dangers-polypharmacy-and-case-deprescribing-older-adults \n[4]National Council on Aging. (2025). Top 10 chronic conditions affecting older adults. \nNational \nCouncil \non \nAging. \nhttps://www.ncoa.org/article/the-top-10-most-common-chronic-conditions-in-older-adults/ \n[5]Cardozo, C., Martín, A., Saldaño, V. y Gaetán, G. (2020). Una propuesta para mejorar \nla experiencia de los adultos mayores con las redes sociales. Tecnología, Ciencia y \nEducación, 16, 113–142 \n \n \n \n"
      }
    },
    {
      "nombre": "FB_IMG_1763078305919.jpg",
      "contenido": {
        "tipo": "texto",
        "texto": "CIRCULAR No. 030/2025\n\nC.C. Funcionarias y Funcionarios del Consejo Universitario,\n\nVicerrectores, Directoras y Directores de Unidades Académicas y\nDependencias Administrativas, Jefas y Jefes de Departamento,\n\nComunidad Universitaria de la Benemérita Universidad Autónoma de Puebla\nPresente\n\nCon fundamento en lo dispuesto por el artículo 59, fracción VII del Estatuto Orgánico de la Benemérita\nUniversidad Autónoma de Puebla y por acuerdo de la Dra. María Lilia Cedillo Ramírez, Rectora de esta\nMáxima Casa de Estudios, en uso de la facultad que le confiere el artículo 56 del ordenamiento antes\ncitado, por este conducto, me permito hacer de su conocimiento lo siguiente:\n\n“Conforme a las solicitudes realizadas por parte de la Lic. Haydee López Mosqueda y el Mtro. Carlos\nArmando Ríos Acevedo, en su calidad de Secretaria y Secretario General del Sindicato\nIndependiente de Trabajadores No Académicos (SITBUAP) y de la Asociación Sindical de Personal\nAcadémico (ASPABUAP) ambos de esta Institución; se autoriza como día no laborable el viernes 14\nde noviembre y el día 17 de noviembre del año en curso, se considera como día de descanso\nobligatorio.\n\nCon excepción del personal que por la naturaleza del trabajo que desempeña no es posible su\ninterrupción, como lo son: el personal del Hospital Universitario de Puebla (HUP), de Radio BUAP,\nde la Dirección de Apoyo y Seguridad Universitaria (DASU) y de la Dirección de Infraestructura\nEducativa (DIE) por los trabajos que se están realizando en CU y CU2; en estos casos, los días\notorgados se programarán en términos de lo previsto por la cláusula 43 del contrato celebrado con\nel SITBUAP y de la cláusula 52 del contrato celebrado con la ASPABUAP.”\n\nAgradezco su atención y reitero la seguridad de mi más distinguida consideración.\n\nAtentamente\n\nE\n\nSecretaria Torre de Gestión Académica y\nGeneral Servicios Administrativos,\npiso 13, (222) 229 55 00 Ext. 5023"
      }
    }
  ]
}